Tekla Open API Reference for Tekla Structures 2025
RebarPropertiesNullable.NumberingSeries Property
 Gets or sets the numbering series of the reinforcement.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NumberingSeriesNullable NumberingSeries { get; set; }
Public Property NumberingSeries As NumberingSeriesNullable
	Get
	Set
Property Value
Type: NumberingSeriesNullable
See Also
Reference
RebarPropertiesNullable Class
Tekla.Structures.Model Namespace